# --------------------------------------------------------------------
# Tuple 데이터 자료형 살펴보기
# - 내장함수 : len(), max(), min(), sum()
# - 연산자 : 덧셈, 곱셈, 멤버연산자
# --------------------------------------------------------------------
nums=11,22,33,44,55

## 내장함수 ---------------------------------------------------------
print(f'nums의 개수 : {len(nums)}개')
print(f'num의 최대값 : {max(nums)}')
print(f'nums의 최솟값 : {min(nums)}')
print(f'합계 : {sum(nums)}')
print(f'정렬 : {sorted(nums,reverse=True)}')

## 연산자 -----------------------------------------------------------
## 덧셈
data1=11,22
data2='a','b','c'
data3=[1,2]

print(data1+tuple(data3))

## 곱셈 : tuple*int

print(data1*5)

## 멤버 연산자 => in , not in
print(11 in data1)
print('a' in data1)