# ---------------------------------------------------------------------
# collection 자료형의 공통적인 부분 살펴보기
# ---------------------------------------------------------------------
## [여러개의 변수에 데이터 저장] ----------------------------------------
# 팩킹(packing) 방식 : 변수명 = tuple 타입
data='홍길동',12,'의적','남'

# ----------------------------------------------------------------
# 언팩킹(unpacking) 방식 : 변1, 변2,...변n = tuple 타입
#                        변수명 개수 == 데이터 개수
# ----------------------------------------------------------------
name, age, job, gender='홍길동',12,'의적','남'
print(name,age, job,gender )

name, age, _, _='철이',15,'의적','남'
print(name,age, _)

jumsu=[100,99]
kor, math = [100, 99]
print(jumsu, kor, math)
print(type(kor))

person={'name':'박', 'age':15}
k1,k2={'name':'박', 'age':15}
print(person, k1, k2)
print(type(person))

# -------------------------------------------------------------------
# 생성자(Constructor)함수 : 타입명과 동일한 이름의 함수
# - int(), str(), bool(), float(), list(), tuple(),dict(), set()
# - map(), range()
# ---------------------------------------------------------------------
# 기본 데이터 타입
num=int(10)         # num(10)
fnum=float(10.0)    # float(10.0)
msg=str("good")     # msg='good'
isok=bool(True)     #isok=True

# 컬렉션 데이터 타입
lnums=list([1,2,3,4])        # lnums=[1,2,3,4]
tnums=tuple((3,6,9))           # tnums=(3,6,9)
ds=dict({'d1':10, 'd2':20})  #dnums={'d1':10, 'd2':20}
ss=set({1,1,3,4,5})          # ss={1,1,3,4,5}

# 타입 변경 => 형변환(타입 캐스팅) --------------------------------------
# dict 자료형은 다른 자료형과 달리 데이터 형태 다름
# 데이터 형태 : 키:값
# - dict(키1=값, 키2=값2,...) : 키는 str만 가능 '',"" 사용 불가능
ds=dict(n1=1,n2=2,gender='남')
print(ds)

ds=dict([('name','마징가'),('age',12)]) # 리스트 형태로 2개씩 묶어놨으니 앞에가 키 뒤에가 값 모양 만들어졌잖아? 그러니 딕트로 만들어짐
print(ds)

ds=dict([['name','마징가'],['age',12]]) # 리스트 형태로 2개씩 묶어놨으니 앞에가 키 뒤에가 값 모양 만들어졌잖아? 그러니 딕트로 만들어짐
print(ds)

## 내장합수 : zip() : 같은 인덱스의 요소끼리 묶어줌
l1=['name','age','gender']
l2=['마징가',12,'남']
l3=[False,True,True]
print(list(zip(l1,l2,l3)))

ds=dict(zip(l1,l2))
print(ds)